bouffalolab/bouffalo_sdk/drivers/sys/bl702/bl702_lp.c
#include <assert.h>
#include "hardware/timer_reg.h"
#include "ef_data_reg.h"
#include "sf_ctrl_reg.h"
#include "bl702_l1c.h"
#include "bl702_clock.h"
#include "bl702_romdriver.h"
#include "bl702_aon.h"
#include "bl702_pds.h"
#include "bl702_hbn.h"
#include "bl702_pm.h"
#include "bflb_core.h"
#include "bflb_rtc.h"
#include "bflb_sec_sha.h"
#include "bflb_acomp.h"
#include "bflb_flash.h"
#include "bflb_sflash.h"
#include "bflb_sf_ctrl.h"
#include "bflb_sf_cfg.h"
#include "bflb_dma.h"
#include "bl_lp.h"
#include "bl_sys.h"
#include <arch/risc-v/e24/clic.h>
#include "tzc_sec_reg.h"



#define LP_FW_PRE_JUMP_ADDR   0x20010000

#define BL702_ACOMP_VREF_1V65 33

#define BL_LP_SOFT_INT_TRIG             (bflb_irq_set_pending(MSOFT_IRQn))
#define BL_LP_SOFT_INT_CLEAR            (bflb_irq_clear_pending(MSOFT_IRQn))


extern uint32_t __itcm_load_addr;
extern uint32_t __tcm_code_start__;
extern uint32_t __tcm_code_end__;

extern void bl_lp_debug_record_time(iot2lp_para_t *iot_lp_para, char *info_str);
extern void bl_lp_debug_clean_time(iot2lp_para_t *iot_lp_para);
extern void bl_lp_debug_dump_time(iot2lp_para_t *iot_lp_para);

bl_lp_fw_cfg_t lpfw_cfg = {
    .rtc_timeout_us = (1 * 1000 * 1000),
    .pds_timeout_us = (10 * 1000 * 1000),
};
#if (BL_LP_TIME_DEBUG)
static lp_fw_time_debug_t time_debug_buff[TIME_DEBUG_NUM_MAX] = { 0 };
#endif

/* EM Select, will get from glb register */
static uint8_t emSel = 0;

struct lp_env {
    void *sys_enter_arg;
    void *user_enter_arg;
    void *sys_exit_arg;
    void *user_exit_arg;

    bl_lp_cb_t sys_pre_enter_callback;
    bl_lp_cb_t user_pre_enter_callback;
    bl_lp_cb_t sys_after_exit_callback;
    bl_lp_cb_t user_after_exit_callback;

    uint8_t wifi_hw_resume;
    uint8_t wifi_fw_ready;
    uint32_t gpio_stat;
};

static struct lp_env *gp_lp_env = NULL;

// static void bl_lp_io_wakeup_init(bl_lp_io_cfg_t *io_wakeup_cfg);
static void bl_lp_acomp_wakeup_init(bl_lp_acomp_cfg_t *acomp_wakeup_cfg);

static bl_lp_io_cfg_t *gp_lp_io_cfg = NULL;
static bl_lp_io_cfg_t g_lp_io_cfg_bak;
static bl_lp_acomp_cfg_t *gp_lp_acomp_cfg = NULL;
static bl_lp_acomp_cfg_t g_lp_acomp_cfg_bak;
static void bl_lp_soft_irq(void);
static bl_lp_soft_irq_callback_t lp_soft_callback = { NULL };

#define GET_OFFSET(_type, _member) ((unsigned long)(&((_type *)0)->_member))

void ATTR_HBN_CODE_SECTION load_tcm_code(void)
{
    uint32_t *pSrc, *pDest;

    /* Copy ITCM code */
    pSrc = &__itcm_load_addr;
    pDest = &__tcm_code_start__;

    for (; pDest < &__tcm_code_end__;) {
        *pDest++ = *pSrc++;
    }
}

void lp_fw_save_cpu_para(uint32_t save_addr)
{
    __asm__ __volatile__(
        "sw      x0, 0(a0)\n\t"
        "sw      x1, 4(a0)\n\t"
        "sw      x2, 8(a0)\n\t"
        "sw      x3, 12(a0)\n\t"
        "sw      x4, 16(a0)\n\t"
        "sw      x5, 20(a0)\n\t"
        "sw      x6, 24(a0)\n\t"
        "sw      x7, 28(a0)\n\t"
        "sw      x8, 32(a0)\n\t"
        "sw      x9, 36(a0)\n\t"
        "sw      x10, 40(a0)\n\t"
        "sw      x11, 44(a0)\n\t"
        "sw      x12, 48(a0)\n\t"
        "sw      x13, 52(a0)\n\t"
        "sw      x14, 56(a0)\n\t"
        "sw      x15, 60(a0)\n\t"
        "sw      x16, 64(a0)\n\t"
        "sw      x17, 68(a0)\n\t"
        "sw      x18, 72(a0)\n\t"
        "sw      x19, 76(a0)\n\t"
        "sw      x20, 80(a0)\n\t"
        "sw      x21, 84(a0)\n\t"
        "sw      x22, 88(a0)\n\t"
        "sw      x23, 92(a0)\n\t"
        "sw      x24, 96(a0)\n\t"
        "sw      x25, 100(a0)\n\t"
        "sw      x26, 104(a0)\n\t"
        "sw      x27, 108(a0)\n\t"
        "sw      x28, 112(a0)\n\t"
        "sw      x29, 116(a0)\n\t"
        "sw      x30, 120(a0)\n\t"
        "sw      x31, 124(a0)\n\t");
}
void lp_fw_restore_cpu_para(uint32_t save_addr)
{
    __asm__ __volatile__(

        /* restore tcm code */
        "call load_tcm_code\n\t"

        ".option push\n\t"
        ".option norelax\n\t"
        "la gp, __global_pointer$\n\t"
        ".option pop\n\t"

        "lw      x0, 0(a0)\n\t"
        "lw      x1, 4(a0)\n\t"
        "lw      x2, 8(a0)\n\t"
        // "lw      x3, 12(a0)\n\t"
        "lw      x4, 16(a0)\n\t"
        "lw      x5, 20(a0)\n\t"
        "lw      x6, 24(a0)\n\t"
        "lw      x7, 28(a0)\n\t"
        "lw      x8, 32(a0)\n\t"
        "lw      x9, 36(a0)\n\t"
        "lw      x10, 40(a0)\n\t"
        "lw      x11, 44(a0)\n\t"
        "lw      x12, 48(a0)\n\t"
        "lw      x13, 52(a0)\n\t"
        "lw      x14, 56(a0)\n\t"
        "lw      x15, 60(a0)\n\t"
        "lw      x16, 64(a0)\n\t"
        "lw      x17, 68(a0)\n\t"
        "lw      x18, 72(a0)\n\t"
        "lw      x19, 76(a0)\n\t"
        "lw      x20, 80(a0)\n\t"
        "lw      x21, 84(a0)\n\t"
        "lw      x22, 88(a0)\n\t"
        "lw      x23, 92(a0)\n\t"
        "lw      x24, 96(a0)\n\t"
        "lw      x25, 100(a0)\n\t"
        "lw      x26, 104(a0)\n\t"
        "lw      x27, 108(a0)\n\t"
        "lw      x28, 112(a0)\n\t"
        "lw      x29, 116(a0)\n\t"
        "lw      x30, 120(a0)\n\t"
        "lw      x31, 124(a0)\n\t"
        // "la      a0, freertos_risc_v_trap_handler\n\t" // mcu default_trap_handler
        "la      a0, freertos_risc_v_trap_handler\n\t"
        "ori     a0, a0, 3\n\t"
        "csrw    mtvec, a0\n\t"

        /* Intial the mtvt, MUST BE 64 bytes aligned*/
        ".weak __Vectors\n\t"
        "la t0, __Vectors\n\t"
        "csrw mtvt, t0\n\t"


        );
}

static void ATTR_TCM_SECTION lp_clock_init(void)
{
    GLB_Set_System_CLK(GLB_DLL_XTAL_32M, GLB_SYS_CLK_DLL144M);
    HBN_Set_XCLK_CLK_Sel(HBN_XCLK_CLK_XTAL);
}


__WEAK void ATTR_TCM_SECTION bl_lp_recovery_hardware(void)
{
    lp_clock_init();

    bl_lp_xip_recovery();
}

__attribute__((used)) void ATTR_HBN_CODE_SECTION lp_fw_pre(void)
{
    // Restore EM select
    BL_WR_REG(GLB_BASE, GLB_SEAM_MISC, emSel);

