bouffalolab/bouffalo_sdk/drivers/sys/bl702/bl702_lp.c
    /* Enable jtag */
    *((volatile uint32_t *)0x40000080) = 0x0001000C;

    /* clear HBN Rsv0 & Rsv1*/
    putreg32(0x0, 0x4000F100);
    putreg32(0x0, 0x4000F104);

    /* jump to lp_fw */
    void (*pFunc)(void);
    pFunc = (void (*)(void))bl_lp_recovery_hardware;
    pFunc();
}

void bl_lp_fw_init()
{
    /* clean iot2lp_para */
    memset(iot2lp_para, 0, (uint32_t)&iot2lp_para->reset_keep - (uint32_t)iot2lp_para);

#if (BL_LP_TIME_DEBUG)
    iot2lp_para->time_debug = (void *)((uint32_t)time_debug_buff & 0x4FFFFFFF);
    bl_lp_debug_clean_time(iot2lp_para);
#endif

    uint32_t flash_cfg_len;
    bflb_flash_get_cfg((uint8_t **)&iot2lp_para->flash_cfg, &flash_cfg_len);

    iot2lp_para->flash_jdec_id=bflb_flash_get_jedec_id();
    //bflb_sflash_get_jedecid((spi_flash_cfg_type*)&iot2lp_para->flash_cfg, (uint8_t *)&iot2lp_para->flash_jdec_id);

    BL_LP_LOG("flash jdec_id 0x%08lX\r\n", (unsigned long)iot2lp_para->flash_jdec_id);

    bl_lp_xip_para_save();
}

__WEAK void bl_lp_io_init(uint64_t value)
{
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    if(value & HBN_WAKEUP_GPIO_9) {
        bflb_gpio_init(gpio, GPIO_PIN_9, GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_0);
    }
    if(value & HBN_WAKEUP_GPIO_10) {
        bflb_gpio_init(gpio, GPIO_PIN_10, GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_0);
    }
    if(value & HBN_WAKEUP_GPIO_11) {
        bflb_gpio_init(gpio, GPIO_PIN_11, GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_0);
    }
    if(value & HBN_WAKEUP_GPIO_12) {
        bflb_gpio_init(gpio, GPIO_PIN_12, GPIO_INPUT | GPIO_SMT_EN | GPIO_DRV_0);
    }
}


static void bl_lp_io_wakeup_init(bl_lp_io_cfg_t *io_wakeup_cfg)
{
    uint64_t io_unmask = io_wakeup_cfg->io_wakeup_unmask;
    uint64_t ie;


    if (io_wakeup_cfg == NULL) {
        return;
    }

    HBN_Hw_Pu_Pd_Cfg(DISABLE);

    /* set ie& mask& inten of aon io 9~13 */
    ie = (io_wakeup_cfg->io_9_ie << 0)
        | (io_wakeup_cfg->io_10_ie << 1)
        | (io_wakeup_cfg->io_11_ie << 2)
        | (io_wakeup_cfg->io_12_ie << 3);
    bl_lp_io_init(ie);
    HBN_Aon_Pad_IeSmt_Cfg(ie&0x1F);
    if ((io_unmask >> 9) & 0x1f) {
        HBN_Pin_WakeUp_Mask((~(uint8_t)((io_unmask >> 9))&0x1f));
        HBN_GPIO_INT_Enable(io_wakeup_cfg->io_9_12_pds_trig_mode);
        PDS_IntEn(PDS_INT_HBN_IRQ_OUT0,ENABLE);
    } else {
        HBN_Aon_Pad_IeSmt_Cfg(0);
    }

}

int bl_lp_io_wakeup_cfg(bl_lp_io_cfg_t *io_wakeup_cfg)
{
    gp_lp_io_cfg = io_wakeup_cfg;
    return 0;
}


int bl_lp_wakeup_acomp_get_mode(uint8_t acomp_num)
{
    uint8_t wakeup_acomp_bits = iot2lp_para->wake_acomp_bits;
    uint8_t wakeup_acomp_edge_bits = iot2lp_para->wake_acomp_edge_bits;

    if (acomp_num == 0) {
        if (g_lp_acomp_cfg_bak.acomp0_en == BL_LP_ACOMP_DISABLE || (wakeup_acomp_bits & 0x01) == 0) {
            return 0;
        }
        if (g_lp_acomp_cfg_bak.acomp0_trig_mode == BL_LP_ACOMP_TRIG_EDGE_FALLING) {
            return BL_LP_ACOMP_WAKEUP_MODE_FALLING;
        } else if (g_lp_acomp_cfg_bak.acomp0_trig_mode == BL_LP_ACOMP_TRIG_EDGE_RISING) {
            return BL_LP_ACOMP_WAKEUP_MODE_RISING;
        } else if (g_lp_acomp_cfg_bak.acomp0_trig_mode == BL_LP_ACOMP_TRIG_EDGE_FALLING_RISING) {
            if (wakeup_acomp_edge_bits & 0x01) {
                return BL_LP_ACOMP_WAKEUP_MODE_RISING;
            } else {
                return BL_LP_ACOMP_WAKEUP_MODE_FALLING;
            }
        } else {
            return -1;
        }
    }

    if (acomp_num == 1) {
        if (g_lp_acomp_cfg_bak.acomp1_en == BL_LP_ACOMP_DISABLE || (wakeup_acomp_bits & 0x02) == 0) {
            return 0;
        }
        if (g_lp_acomp_cfg_bak.acomp1_trig_mode == BL_LP_ACOMP_TRIG_EDGE_FALLING) {
            return BL_LP_ACOMP_WAKEUP_MODE_FALLING;
        } else if (g_lp_acomp_cfg_bak.acomp1_trig_mode == BL_LP_ACOMP_TRIG_EDGE_RISING) {
            return BL_LP_ACOMP_WAKEUP_MODE_RISING;
        } else if (g_lp_acomp_cfg_bak.acomp1_trig_mode == BL_LP_ACOMP_TRIG_EDGE_FALLING_RISING) {
            if (wakeup_acomp_edge_bits & 0x02) {
                return BL_LP_ACOMP_WAKEUP_MODE_RISING;
            } else {
                return BL_LP_ACOMP_WAKEUP_MODE_FALLING;
            }
        } else {
            return -1;
        }
    }

    return -2;
}

uint32_t bl_lp_set_acomp(uint8_t chan, uint8_t pin, uint8_t pos_edge_en, uint8_t neg_edge_en)
{
    struct bflb_acomp_config_s acompCfg = {
        .mux_en = ENABLE,                                      /*!< ACOMP mux enable */
        .pos_chan_sel = AON_ACOMP_CHAN_ADC0,                   /*!< ACOMP negtive channel select */
        .neg_chan_sel = AON_ACOMP_CHAN_VIO_X_SCALING_FACTOR_1, /*!< ACOMP positive channel select */
        .vio_sel = BL702_ACOMP_VREF_1V65,                      /*!< ACOMP vref select */
        .scaling_factor =
            AON_ACOMP_SCALING_FACTOR_1,          /*!< ACOMP level select factor */
        .bias_prog = AON_ACOMP_BIAS_POWER_MODE3, /*!< ACOMP bias current control */
        .hysteresis_pos_volt =
            AON_ACOMP_HYSTERESIS_VOLT_NONE, /*!< ACOMP hysteresis voltage for positive */
        .hysteresis_neg_volt =
            AON_ACOMP_HYSTERESIS_VOLT_NONE, /*!< ACOMP hysteresis voltage for negtive */
    };


    uint32_t channel = 0;

    bflb_acomp_gpio_2_chanid(pin,(uint32_t*)&channel);
    acompCfg.pos_chan_sel =channel;

    /* Config Gpio as Analog */
    struct bflb_device_s *gpio;

    gpio = bflb_device_get_by_name("gpio");
    bflb_gpio_init(gpio, pin, GPIO_ANALOG | GPIO_SMT_EN | GPIO_DRV_0);

    /* Config Comp0/1 */
    bflb_acomp_init(chan, &acompCfg);
    bflb_acomp_enable(chan);

    HBN_Clear_IRQ(HBN_INT_ACOMP0 + chan * 2);

    /* enable/disable POSEDGE */
    if (pos_edge_en) {
        HBN_Enable_AComp_IRQ(chan, HBN_ACOMP_INT_EDGE_POSEDGE);
    } else {
        HBN_Disable_AComp_IRQ(chan, HBN_ACOMP_INT_EDGE_POSEDGE);
    }

    /* enable/disable NEGEDGE */
    if (neg_edge_en) {
        HBN_Enable_AComp_IRQ(chan, HBN_ACOMP_INT_EDGE_NEGEDGE);
    } else {
        HBN_Disable_AComp_IRQ(chan, HBN_ACOMP_INT_EDGE_NEGEDGE);
    }

    /* UnMask Hbn_Irq1 Wakeup PDS*/
    PDS_IntEn(PDS_INT_HBN_IRQ_OUT1,ENABLE);

