bouffalolab/bouffalo_sdk/drivers/sys/bl702/bl702_lp.c
    return 0;
}


static void bl_lp_acomp_wakeup_init(bl_lp_acomp_cfg_t *acomp_wakeup_cfg)
{
    if (acomp_wakeup_cfg->acomp0_en && acomp_wakeup_cfg->acomp0_trig_mode) {
        bl_lp_set_acomp(0, acomp_wakeup_cfg->acomp0_io_num, (acomp_wakeup_cfg->acomp0_trig_mode & 0x02), (acomp_wakeup_cfg->acomp0_trig_mode & 0x01));
    } else {
        bflb_acomp_disable(0);
    }

    if (acomp_wakeup_cfg->acomp1_en && acomp_wakeup_cfg->acomp1_trig_mode) {
        bl_lp_set_acomp(1, acomp_wakeup_cfg->acomp1_io_num, (acomp_wakeup_cfg->acomp1_trig_mode & 0x02), (acomp_wakeup_cfg->acomp1_trig_mode & 0x01));
    } else {
        bflb_acomp_disable(1);
    }

    arch_delay_us(15);
    HBN_Clear_IRQ(HBN_INT_ACOMP0);
    HBN_Clear_IRQ(HBN_INT_ACOMP1);
}

int bl_lp_acomp_wakeup_cfg(bl_lp_acomp_cfg_t *acomp_wakeup_cfg)
{
    gp_lp_acomp_cfg = acomp_wakeup_cfg;
    return 0;
}
__WEAK uint64_t bl_lp_check_gpio_int(void)
{
    uint64_t result = 0;
    return result;
}
__WEAK uint8_t bl_lp_check_acomp_int(void)
{
    uint8_t result = 0;
    return result;
}


static void bl_lp_clear_wakeup_reason(void)
{
    /* clean wakeup reason */
    iot2lp_para->wakeup_reason = LPFW_WAKEUP_UNKOWN;
    /* clean wakeup bits */
    iot2lp_para->wake_io_bits = 0;
    iot2lp_para->wake_acomp_bits = 0;
    iot2lp_para->wake_io_edge_bits = 0;
    iot2lp_para->wake_acomp_edge_bits = 0;
}

static void bl_lp_clear_rtc_param(void)
{
    iot2lp_para->rtc_wakeup_en = 0;
    iot2lp_para->rtc_wakeup_cnt = 0;
}

static void rtc_wakeup_init(uint64_t rtc_wakeup_cmp_cnt, uint64_t sleep_us)
{
    uint64_t rtc_cnt;

    if (sleep_us == 0) {
        return;
    }

    /* Clear RTC Compare type */
    HBN_Clear_RTC_INT();

    if (rtc_wakeup_cmp_cnt == 0) {
        /* Get RTC Cnt  */
        uint32_t valLow = 0, valHigh = 0;
        HBN_Get_RTC_Timer_Val(&valLow, &valHigh);
        rtc_cnt = valLow + ((uint64_t)valHigh << 32);
        /* calculate RTC Comp cnt */
        rtc_cnt += BL_US_TO_PDS_CNT(sleep_us);
    } else {
        rtc_cnt = rtc_wakeup_cmp_cnt;
    }

    iot2lp_para->rtc_wakeup_cnt = rtc_cnt;
    iot2lp_para->rtc_wakeup_en = 1;

    /* Set RTC compare mode, and Set RTC Wakeup time */
    HBN_Set_RTC_Timer(HBN_RTC_INT_DELAY_0T, rtc_cnt & 0xffffffff, rtc_cnt >> 32, HBN_RTC_COMP_BIT0_39);
    /* Enable rtc */
    HBN_Enable_RTC_Counter();
}

static void bl_lp_set_wakeup_reason(void)
{
    if (PDS_Get_IntStatus(PDS_INT_PDS_SLEEP_CNT)) {
        iot2lp_para->wakeup_reason |= LPFW_WAKEUP_PDSTIMER;
    } else if (PDS_Get_IntStatus(PDS_INT_HBN_IRQ_OUT0)) {
        if (SET == HBN_Get_INT_State(HBN_INT_GPIO9)) {
            iot2lp_para->wakeup_reason |= LPFW_WAKEUP_IO;
            iot2lp_para->wake_io_bits |= (1<<9);
            HBN_Clear_IRQ(HBN_INT_GPIO9);
        }
        if (SET == HBN_Get_INT_State(HBN_INT_GPIO10)) {
            iot2lp_para->wakeup_reason |= LPFW_WAKEUP_IO;
            iot2lp_para->wake_io_bits |= (1<<10);
            HBN_Clear_IRQ(HBN_INT_GPIO10);
        }
        if (SET == HBN_Get_INT_State(HBN_INT_GPIO11)) {
            iot2lp_para->wakeup_reason |= LPFW_WAKEUP_IO;
            iot2lp_para->wake_io_bits |= (1<<11);
            HBN_Clear_IRQ(HBN_INT_GPIO11);
        }
        if (SET == HBN_Get_INT_State(HBN_INT_GPIO12)) {
            iot2lp_para->wakeup_reason |= LPFW_WAKEUP_IO;
            iot2lp_para->wake_io_bits |= (1<<12);
            HBN_Clear_IRQ(HBN_INT_GPIO12);
        }
        if (SET == HBN_Get_INT_State(HBN_INT_GPIO13)) {
            iot2lp_para->wakeup_reason |= LPFW_WAKEUP_IO;
            iot2lp_para->wake_io_bits |= (1<<13);
            HBN_Clear_IRQ(HBN_INT_GPIO13);
        }
        /* Get RTC Cnt  */
        uint64_t current_rtc_cnt;
        uint32_t valLow = 0, valHigh = 0;
        HBN_Get_RTC_Timer_Val(&valLow, &valHigh);
        current_rtc_cnt = valLow + ((uint64_t)valHigh << 32);
        if( current_rtc_cnt >= iot2lp_para->rtc_wakeup_cnt ){
            iot2lp_para->wakeup_reason |= LPFW_WAKEUP_RTC;
        }

    } else if (PDS_Get_IntStatus(PDS_INT_HBN_IRQ_OUT1)) {
        /* ACOMP0 */
        if (SET == HBN_Get_INT_State(HBN_INT_ACOMP0)) {
            iot2lp_para->wake_acomp_bits |= (1<<0);
            iot2lp_para->wake_acomp_edge_bits |= (bflb_acomp_get_result(AON_ACOMP0_ID)<<0);
            iot2lp_para->wakeup_reason |= LPFW_WAKEUP_ACOMP;
            HBN_Clear_IRQ(HBN_INT_ACOMP0);
        }
        /* ACOMP1 */
        if (SET == HBN_Get_INT_State(HBN_INT_ACOMP1)) {
            iot2lp_para->wake_acomp_bits |= (1<<1);
            iot2lp_para->wake_acomp_edge_bits |= (bflb_acomp_get_result(AON_ACOMP1_ID)<<1);
            iot2lp_para->wakeup_reason |= LPFW_WAKEUP_ACOMP;
            HBN_Clear_IRQ(HBN_INT_ACOMP1);
        }
    } else {
        iot2lp_para->wakeup_reason |= LPFW_WAKEUP_RTC;
    }
}

int bl_lp_fw_enter(bl_lp_fw_cfg_t *bl_lp_fw_cfg)
{
    uint64_t rtc_sleep_us;
    uint64_t pds_sleep_us;
    if (bl_lp_fw_cfg == NULL) {
        return -1;
    }

    rtc_sleep_us = bl_lp_fw_cfg->rtc_timeout_us;
    pds_sleep_us = bl_lp_fw_cfg->pds_timeout_us;

    if ((rtc_sleep_us == 0) & (pds_sleep_us == 0)) {
        /* no wake-up source */
        return -2;
    }

    bl_lp_debug_record_time(iot2lp_para, "bl_lp_fw_enter");

    bl_lp_clear_wakeup_reason();

    LP_HOOK(pre_user, bl_lp_fw_cfg);

    __disable_irq();

    LP_HOOK(pre_sys, bl_lp_fw_cfg);

    rtc_sleep_us = bl_lp_fw_cfg->rtc_timeout_us;
    pds_sleep_us = bl_lp_fw_cfg->pds_timeout_us;

    bl_lp_clear_rtc_param();

#if 0
    /* get glb gpio inturrpt status */
    uint64_t glb_io_int_stat = bl_lp_check_gpio_int();
    iot2lp_para->wake_io_bits = glb_io_int_stat;
    uint8_t acomp_int_stat = bl_lp_check_acomp_int();
    iot2lp_para->wake_acomp_bits = acomp_int_stat;
#endif

    // BL_LP_LOG("rtc_sleep_ms: %lld\r\n", rtc_sleep_us / (uint64_t)1000);
    // BL_LP_LOG("pds_sleep_ms: %lld\r\n", pds_sleep_us / (uint64_t)1000);

    /* Set lp_fw as the wake-up entry  */
    extern void lp_fw_pre(void);
    pm_set_wakeup_callback((void (*)(void))lp_fw_pre);

    pm_pds_mask_all_wakeup_src();
    HBN_Pin_WakeUp_Mask(0x1F);
    PDS_Set_Vddcore_GPIO_IntMask(MASK);
    PDS_Set_Vddcore_GPIO_IntClear();

