bouffalolab/bouffalo_sdk/drivers/sys/bl702/bl702_lp.c
    if (gp_lp_io_cfg) {
        g_lp_io_cfg_bak = *gp_lp_io_cfg;
        BL_LP_LOG("io_wakeup_unmask: 0x%llX\r\n", (unsigned long long)g_lp_io_cfg_bak.io_wakeup_unmask);
        bl_lp_io_wakeup_init(&g_lp_io_cfg_bak);
    }

    if (gp_lp_acomp_cfg) {
        g_lp_acomp_cfg_bak = *gp_lp_acomp_cfg;
        BL_LP_LOG("acomp0: %d, acomp1: %d\r\n", g_lp_acomp_cfg_bak.acomp0_trig_mode, g_lp_acomp_cfg_bak.acomp1_trig_mode);
        bl_lp_acomp_wakeup_init(&g_lp_acomp_cfg_bak);
    }

    /* lpfw cfg: system para */
    iot2lp_para->mcu_sts = bl_lp_fw_cfg->mcu_sts;
    iot2lp_para->lpfw_wakeup_cnt = 0;
    iot2lp_para->pattern = 0xAA5555AA;
    iot2lp_para->wakeup_flag = 0;
    iot2lp_para->flash_offset = bflb_sf_ctrl_get_flash_image_offset(0, SF_CTRL_SEL_FLASH);
    iot2lp_para->app_entry = (uintptr_t)lp_fw_restore_cpu_para;
    iot2lp_para->args[0] = GET_OFFSET(iot2lp_para_t, cpu_regs) + IOT2LP_PARA_ADDR;
    iot2lp_para->l1c_way_dis = (getreg32(0x40009000) >> 8) & 0xF;

    /* Minimum limit */
    if (pds_sleep_us == 0) {
        /* Mask PDS_Timer Wakeup */
    }else if (pds_sleep_us < (PDS_WAKEUP_MINI_LIMIT_US + PDS_WAKEUP_DELAY_US)) {
        pds_sleep_us = PDS_WAKEUP_MINI_LIMIT_US;
    } else {
        pds_sleep_us -= PDS_WAKEUP_DELAY_US;
    }

    if (rtc_sleep_us == 0) {
        /* Mask RTC Wakeup */
    }else if (rtc_sleep_us < (PDS_WAKEUP_MINI_LIMIT_US + PDS_WAKEUP_DELAY_US)) {
        rtc_sleep_us = PDS_WAKEUP_MINI_LIMIT_US;
    } else {
        rtc_sleep_us -= PDS_WAKEUP_DELAY_US;
    }

    LP_HOOK(pre_sleep, iot2lp_para);

    L1C_Cache_Flush();

    bl_lp_debug_record_time(iot2lp_para, "lp_fw_save_cpu_para");

    lp_fw_save_cpu_para(GET_OFFSET(iot2lp_para_t, cpu_regs) + IOT2LP_PARA_ADDR);

    if (iot2lp_para->wakeup_flag == 0) {

        if (rtc_sleep_us) {
            rtc_wakeup_init(0, rtc_sleep_us);

            /* UnMask Hbn_Irq0 Wakeup PDS*/
            PDS_IntEn(PDS_INT_HBN_IRQ_OUT0,ENABLE);
            PDS_IntMask(PDS_INT_WAKEUP, UNMASK);
        } else {
            /* Clear RTC Compare type */
            HBN_Clear_RTC_INT();
        }

        // BL_LP_LOG("pds_sleep_ms: %lld\r\n", pds_sleep_us / (uint64_t)1000);
        // BL_LP_LOG("rtc_wakeup_cnt: %lld\r\n", iot2lp_para->rtc_wakeup_cnt);

        /* pds15 enter */
        pm_pds_mode_enter(PM_PDS_LEVEL_31, BL_US_TO_PDS_CNT(pds_sleep_us));

        lp_fw_pre();
        iot2lp_para->wakeup_flag = 1;
        lp_fw_restore_cpu_para(GET_OFFSET(iot2lp_para_t, cpu_regs) + IOT2LP_PARA_ADDR);
    }

    /* disable wdt */
    uint32_t regval = 0;

    putreg16(0xBABA, 0x4000A500 + TIMER_WFAR_OFFSET);
    putreg16(0xEB10, 0x4000A500 + TIMER_WSAR_OFFSET);

    regval = getreg32(0x4000A500 + TIMER_WMER_OFFSET);
    regval &= ~TIMER_WE;
    putreg32(regval, 0x4000A500 + TIMER_WMER_OFFSET);

    bl_lp_debug_record_time(iot2lp_para, "return APP");

    L1C_Cache_Enable_Set(iot2lp_para->l1c_way_dis);

#ifdef CONF_PSRAM_RESTORE
    board_psram_x8_init();
#endif

    bl_lp_set_wakeup_reason();

    LP_HOOK(post_sys, iot2lp_para);

    PDS_IntClear();

    bl_lp_fw_cfg->wakeup_reason = iot2lp_para->wakeup_reason;

    /* register */
    bflb_irq_attach(MSOFT_IRQn, (irq_callback)bl_lp_soft_irq, NULL);
    /* trig soft int */
    BL_LP_SOFT_INT_TRIG;

#if 0
    BL_LP_LOG("--app wakeup reason %ld\r\n", bl_lp_fw_cfg->wakeup_reason);
    BL_LP_LOG("wake_io_bits 0x%016llx\r\n", iot2lp_para->wake_io_bits);
    BL_LP_LOG("wake_acomp_bits 0x%x\r\n", iot2lp_para->wake_acomp_bits);
    BL_LP_LOG("wake_io_edge_bits 0x%016llx\r\n", iot2lp_para->wake_io_edge_bits);
    BL_LP_LOG("wake_acomp_edge_bits 0x%x\r\n", iot2lp_para->wake_acomp_edge_bits);
#endif

#if (BL_LP_TIME_DEBUG)
    bl_lp_debug_dump_time(iot2lp_para);
    bl_lp_debug_clean_time(iot2lp_para);
#endif

    return iot2lp_para->wakeup_reason;
}


int bl_lp_init(void)
{
    assert(!gp_lp_env);

    emSel = BL_RD_REG(GLB_BASE, GLB_SEAM_MISC);

    gp_lp_env = malloc(sizeof(struct lp_env));
    assert(gp_lp_env);

    memset(gp_lp_env, 0, sizeof(struct lp_env));

    bl_lp_fw_init();

    return 0;
}

int bl_lp_sys_callback_register(bl_lp_cb_t enter_callback, void *enter_arg, bl_lp_cb_t exit_callback, void *exit_arg)
{
    assert(gp_lp_env);

    if (enter_callback == NULL && exit_callback == NULL) {
        return -1;
    }

    gp_lp_env->sys_pre_enter_callback = enter_callback;
    gp_lp_env->sys_after_exit_callback = exit_callback;
    gp_lp_env->sys_enter_arg = enter_arg;
    gp_lp_env->sys_exit_arg = exit_arg;

    return 0;
}

int bl_lp_user_callback_register(bl_lp_cb_t enter_callback, void *enter_arg, bl_lp_cb_t exit_callback, void *exit_arg)
{
    assert(gp_lp_env);

    if (enter_callback == NULL && exit_callback == NULL) {
        return -1;
    }

    gp_lp_env->user_pre_enter_callback = enter_callback;
    gp_lp_env->user_after_exit_callback = exit_callback;
    gp_lp_env->user_enter_arg = enter_arg;
    gp_lp_env->user_exit_arg = exit_arg;

    return 0;
}

void bl_lp_call_user_pre_enter(void)
{
    assert(gp_lp_env);

    if (gp_lp_env->user_pre_enter_callback) {
        gp_lp_env->user_pre_enter_callback(gp_lp_env->user_enter_arg);
    }
}

void bl_lp_call_user_after_exit(void)
{
    assert(gp_lp_env);

    if (gp_lp_env->user_after_exit_callback) {
        gp_lp_env->user_after_exit_callback(gp_lp_env->user_exit_arg);
    }
}

void bl_lp_call_sys_pre_enter(void)
{
    assert(gp_lp_env);

    if (gp_lp_env->sys_pre_enter_callback) {
        gp_lp_env->sys_pre_enter_callback(gp_lp_env->sys_enter_arg);
    }
}

void bl_lp_call_sys_after_exit(void)
{
    assert(gp_lp_env);

    if (gp_lp_env->sys_after_exit_callback) {
        gp_lp_env->sys_after_exit_callback(gp_lp_env->sys_exit_arg);
    }
}

static void bl_lp_soft_irq(void)
{
    uint64_t wakeup_io_bits = iot2lp_para->wake_io_bits;
    uint32_t wakeup_acmp_bits = iot2lp_para->wake_acomp_bits;

    /* disable soft int */
    bflb_irq_disable(MSOFT_IRQn);
    /* clear soft int */
    BL_LP_SOFT_INT_CLEAR;

    /* exit user */
    LP_HOOK(post_user, iot2lp_para);

    if (wakeup_io_bits && lp_soft_callback.wakeup_io_callback) {
        lp_soft_callback.wakeup_io_callback(wakeup_io_bits);
    }

    if (wakeup_acmp_bits && lp_soft_callback.wakeup_acomp_callback) {
        lp_soft_callback.wakeup_acomp_callback(wakeup_acmp_bits);
    }

    /* clear */
    iot2lp_para->wake_io_bits = 0;
    iot2lp_para->wake_acomp_bits = 0;
}

void bl_lp_wakeup_io_int_register(void (*wakeup_io_callback)(uint64_t wake_up_io_bits))
{
    lp_soft_callback.wakeup_io_callback = wakeup_io_callback;
}

void bl_lp_wakeup_acomp_int_register(void (*wakeup_acomp_callback)(uint32_t wake_up_acomp))
{
    lp_soft_callback.wakeup_acomp_callback = wakeup_acomp_callback;
}

int bl_lp_get_wake_reason(void)
{
    return (int)iot2lp_para->wakeup_reason;
}

int bl_lp_get_wake_io_state(void)
{
    return (int)gp_lp_env->gpio_stat;
}
